# customer-api - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.aws_lambda.data.archive_file.default: Reading...
module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.kafka_topic_credential.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/production-customer-api]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Reading...
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=dmywjyormj]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda.aws_iam_role.default: Refreshing state... [id=lambda-execution-customer-api-production]
module.common_resources.module.kafka_topic_credential.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=production-kafka-cluster-id]
module.common_resources.module.kafka_topic_credential.upstash_kafka_credential.default: Refreshing state... [id=upstash-kafka-credential-a440b083-4d79-4a4f-8dcd-a353e6821f68]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=production-cockroachdb-serverless-cluster-id]
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=2539ad74-c3bc-4b10-bb6e-e55edf9e9fbf:production-customer-api]
module.common_resources.module.aws_api_gateway.aws_ssm_parameter.default: Refreshing state... [id=production_customer_api_endpoint]
module.common_resources.module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/production-customer-api]
module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-customer-api-production-20230427100649546400000001]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.common_resources.module.aws_lambda.data.archive_file.default: Read complete after 2s [id=9f8185544c5882212e48a2b70c764b996761e096]
module.common_resources.module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=production-customer-api]
module.common_resources.module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=ot9pxvi]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_route.any: Refreshing state... [id=smazsvg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default will be updated in-place
  ~ resource "aws_apigatewayv2_api" "default" {
        id                           = "dmywjyormj"
      ~ name                         = "production-customer-api" -> "production_customer_api"
        tags                         = {
            "domain"        = "customer"
            "environment"   = "production"
            "resource"      = "customer-api"
            "resource_type" = "api_gateway"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.common_resources.module.aws_api_gateway.aws_apigatewayv2_stage.default will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "default" {
        id              = "$default"
        name            = "$default"
        tags            = {
            "domain"        = "customer"
            "environment"   = "production"
            "resource"      = "customer-api"
            "resource_type" = "api_gateway"
        }
        # (8 unchanged attributes hidden)

      ~ access_log_settings {
          ~ destination_arn = "arn:aws:logs:us-east-1:514472330244:log-group:/aws/api_gateway/production-customer-api" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.common_resources.module.aws_api_gateway.aws_cloudwatch_log_group.default must be replaced
-/+ resource "aws_cloudwatch_log_group" "default" {
      ~ arn               = "arn:aws:logs:us-east-1:514472330244:log-group:/aws/api_gateway/production-customer-api" -> (known after apply)
      ~ id                = "/aws/api_gateway/production-customer-api" -> (known after apply)
      ~ name              = "/aws/api_gateway/production-customer-api" -> "/aws/api_gateway/production_customer_api" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "domain"        = "customer"
            "environment"   = "production"
            "resource"      = "customer-api"
            "resource_type" = "api_gateway"
        }
        # (3 unchanged attributes hidden)
    }

  # module.common_resources.module.aws_lambda.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "production-customer-api"
        tags                           = {
            "domain"        = "customer"
            "environment"   = "production"
            "resource"      = "customer-api"
            "resource_type" = "lambda"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING" = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "production-customer"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "production-customer-api"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "2539ad74-c3bc-4b10-bb6e-e55edf9e9fbf:production-customer-api"
        name       = "production-customer-api"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "929618c2-7a8e-4245-8461-94d584b848dc" -> "336d6b4f-53f0-4c20-b0e9-6da6938164dd"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 2 to add, 4 to change, 2 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*